app/controllers/products_controller.rb

INSERT INTO "products" ("product_name", "product_type", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_name", "snake"], ["product_type", "novelty"], ["created_at", "2016-02-16 11:52:56.100689"], ["updated_at", "2016-02-16 11:52:56.100689"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save